src/tr069/samples/tr069_set_parameter_values_20param_req.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">null0</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:SetParameterValues>
            <ParameterList soap:arrayType="cwmp:ParameterValueStruct[7]">
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.PeriodicInformEnable</Name>
                    <Value xsi:type="xsd:boolean">1</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestUsername</Name>
                    <Value xsi:type="xsd:string">000FB3-MI424WR-cavisson123</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestPassword</Name>
                    <Value xsi:type="xsd:string">a3ed4fc643f3740465f890af2a4ed05a</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.PeriodicInformInterval</Name>
                    <Value xsi:type="xsd:unsignedInt">120</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.URL</Name>
                    <Value xsi:type="xsd:string">https://new.verizon.com/tr069_service/tr069_inform_spv_gpv.xml</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Username</Name>
                    <Value xsi:type="xsd:string">UserNameForManagementServerURL</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.PeriodicInformEnable</Name>
                    <Value xsi:type="xsd:boolean">1</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestUsername</Name>
                    <Value xsi:type="xsd:string">000FB3-MI424WR-cavisson123</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestPassword</Name>
                    <Value xsi:type="xsd:string">a3ed4fc643f3740465f890af2a4ed05a</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.PeriodicInformInterval</Name>
                    <Value xsi:type="xsd:unsignedInt">120</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.URL</Name>
                    <Value xsi:type="xsd:string">https://new.verizon.com/tr069_service/tr069_inform_spv_gpv.xml</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Username</Name>
                    <Value xsi:type="xsd:string">UserNameForManagementServerURL</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
                 <ParameterValueStruct>
                    <Name>InternetGatewayDevice.ManagementServer.Password</Name>
                    <Value xsi:type="xsd:string">PasswordForManagementServerURL</Value>
                </ParameterValueStruct>
            </ParameterList>
            <ParameterKey>null</ParameterKey>
        </cwmp:SetParameterValues>
    </soapenv:Body>
</soapenv:Envelope>
